{
  "irVersion": "10",
  "producerName": "skl2onnx",
  "producerVersion": "1.19.1",
  "domain": "ai.onnx",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "X"
        ],
        "output": [
          "cast_input"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "11",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "cast_input",
          "coefficient"
        ],
        "output": [
          "mul_result"
        ],
        "name": "MatMul",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result",
          "intercepts"
        ],
        "output": [
          "add_result"
        ],
        "name": "Add",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result"
        ],
        "output": [
          "next_activations"
        ],
        "name": "Sigmoid",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations",
          "coefficient1"
        ],
        "output": [
          "mul_result1"
        ],
        "name": "MatMul1",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result1",
          "intercepts1"
        ],
        "output": [
          "add_result1"
        ],
        "name": "Add1",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result1"
        ],
        "output": [
          "next_activations1"
        ],
        "name": "Sigmoid1",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations1",
          "coefficient2"
        ],
        "output": [
          "mul_result2"
        ],
        "name": "MatMul2",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result2",
          "intercepts2"
        ],
        "output": [
          "add_result2"
        ],
        "name": "Add2",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result2"
        ],
        "output": [
          "out_activations_result"
        ],
        "name": "Sigmoid2",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "binariser_output"
        ],
        "name": "N11",
        "opType": "Binarizer",
        "attribute": [
          {
            "name": "threshold",
            "f": 0.5,
            "type": "FLOAT"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "binariser_output"
        ],
        "output": [
          "label"
        ],
        "name": "Cast1",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "output_probability"
        ],
        "name": "ZipMap",
        "opType": "ZipMap",
        "attribute": [
          {
            "name": "classlabels_int64s",
            "ints": [
              "0",
              "1",
              "2",
              "3",
              "4"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "label"
        ],
        "output": [
          "output_label"
        ],
        "name": "Cast2",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      }
    ],
    "name": "ONNX(MLPClassifier)",
    "initializer": [
      {
        "dims": [
          "17",
          "30"
        ],
        "dataType": 11,
        "name": "coefficient",
        "doubleData": [
          10.24303133531876,
          -0.18243167736948465,
          13.887630156779858,
          -1.2554027665348575,
          3.5619212860857017,
          0.14539770597553786,
          -13.905352957063773,
          12.54799529324355,
          3.997627047622088,
          -0.3719555958585027,
          1.6337261381437376,
          -7.719482494593997,
          -0.7271877263258455,
          -4.95710733503311,
          19.913632128890793,
          0.3346673585169526,
          -17.134040055591385,
          -2.438987093066418,
          6.351655435131607,
          -1.4860761063365926,
          -17.517801522287137,
          23.832072925897236,
          -5.298397325754772,
          -20.693217274537272,
          -16.54046190899987,
          20.83624945856098,
          -30.56665529606257,
          3.5420163015695176,
          23.600258424829246,
          -0.32660528734145594,
          -8.829197531182736,
          1.9342192394580073,
          -12.521023384806117,
          -6.849977350491773,
          -7.502994730719971,
          -4.294202422743491,
          -23.742183145691868,
          8.409516752537138,
          -2.9897732679075806,
          -1.3841517483439205,
          -4.5799508262288775,
          -28.12561024611999,
          -0.49037256909962335,
          -21.993653267608945,
          4.031548847080255,
          -7.3003530248175705,
          -31.37575380292144,
          5.546593825545462,
          -40.16053020459654,
          12.10148408443583,
          14.652751370706149,
          -16.93803232927487,
          0.8897040605725215,
          -13.9733724140811,
          -17.12533031172236,
          0.3279210387115191,
          7.667001899815948,
          -14.75782364643584,
          -11.479707862575323,
          -2.7835637821834522,
          -17.012570509004124,
          -2.5790521822279304,
          16.25031585929664,
          10.029010136028454,
          3.689924006031827,
          -4.4035125831238,
          23.90257150859593,
          11.219088975675623,
          -5.960402720628134,
          25.21830915079758,
          25.082718537387805,
          5.357798692894089,
          15.391506201317705,
          -0.017577614579919666,
          -7.727452559189264,
          -11.846662898039613,
          -6.211313341892071,
          -4.788790981767825,
          16.63118032272186,
          15.485903573015404,
          22.51440396640496,
          -3.134589885654943,
          -2.9052574348819054,
          15.819060688714877,
          8.491387739336197,
          -9.994933928729923,
          4.403862763671787,
          3.545192807072109,
          11.023084197977443,
          -1.9921309524486606,
          -9.885023188040723,
          -13.576298934534334,
          4.206308646475832,
          10.13002738518648,
          32.69488535675381,
          -21.175300628559448,
          -6.213811310104325,
          -1.256237157227021,
          20.401219153366704,
          -5.014633123981478,
          23.691661204942925,
          1.9007045382878913,
          -14.540573619735888,
          11.014064549580024,
          23.818091165101716,
          6.15603252948191,
          -0.487733382456382,
          -1.116088542236507,
          -5.327445910776065,
          11.322648536507687,
          -17.110351988335072,
          -9.627190764688224,
          -10.318482050438739,
          32.14230908329353,
          24.584320754168875,
          -13.400057176006671,
          -6.921234833225551,
          -15.027901767743687,
          6.059887060963535,
          20.4312040034738,
          0.09293282000668021,
          0.0005463982629447528,
          0.18816574036978714,
          0.059405820295393846,
          -0.03141500828497504,
          0.043894488603720944,
          -0.1983657402437967,
          -0.08186397994986636,
          0.0660825558633539,
          -0.08660736639545269,
          0.04868944834230052,
          -0.02938779009726028,
          -0.1503919179893333,
          -0.08322235790194232,
          0.02886531815595353,
          0.03749123866302745,
          0.03066425631877101,
          0.06320583221796547,
          0.0627530177220719,
          -0.0282945931180274,
          0.16360263363695418,
          -0.05463980041895303,
          -0.026460111484571225,
          0.1616952301072768,
          0.12632599431154604,
          0.0841180067732579,
          -0.16493379284364137,
          0.1730653121009709,
          0.0883892112724192,
          0.20580856048267895,
          -0.14462658659511396,
          0.15187721474842383,
          -0.13924478317489658,
          0.04767623592430628,
          -0.15520002484283332,
          0.14357723263834196,
          0.1267901213628421,
          0.028508787975706773,
          -0.038293247699516586,
          -0.17774812579083277,
          0.08145289249764417,
          -0.019166825652010583,
          0.09161314525777989,
          0.15115780608660087,
          0.1961851933251734,
          0.14679325073345242,
          -0.20145138712820862,
          -0.057768639695717716,
          0.0948868610092731,
          -0.1354752510053629,
          0.008679041035247387,
          -0.18386610699093117,
          -0.12377198326932957,
          -0.1986427403215524,
          0.12117042048810248,
          -0.11389997692081914,
          -0.06380302489097137,
          0.1766128564825424,
          0.08433494287408641,
          -0.1931485099010677,
          12.129127492298313,
          -3.8674218741382136,
          14.978755569095824,
          -8.703191459291288,
          5.347418945923438,
          18.229030533488356,
          -19.129769814813507,
          2.421544217581286,
          20.60781815575983,
          -20.127704437640734,
          7.252334110011376,
          10.656368661643896,
          12.599377368144209,
          10.67174380420485,
          17.41489977825105,
          -16.749187299713952,
          3.243965586662968,
          -9.821794199187556,
          3.6549355540559807,
          -11.539295110571759,
          -19.140276712713945,
          -2.025312389093854,
          7.881592237961283,
          5.64519295049897,
          -3.4464854502808,
          -8.118887272940267,
          -1.3863375630158914,
          -7.251979415986442,
          19.594964460413802,
          10.971738873189842,
          10.565621416683085,
          -8.21188741890163,
          25.75916581239288,
          -8.24371540220237,
          -9.69927861722066,
          -3.8099699514196352,
          -4.15900206186309,
          -7.27079492694583,
          -4.310628768438152,
          5.164110682325997,
          6.779185450358929,
          10.184884326808858,
          -20.56190370892183,
          -9.195208562500946,
          -20.37718362238228,
          13.321803457848446,
          -0.12826464433653212,
          6.020234685432027,
          -20.7233773863239,
          4.59863085273622,
          1.8992060072229426,
          -7.216076970311989,
          -6.740893485719259,
          -9.540217504353967,
          0.2835184843191591,
          10.819854766964186,
          -9.462784450015064,
          23.744805906187175,
          -1.4387249430368887,
          9.843654838454752,
          8.727295007018139,
          28.405584516921152,
          1.7157237391738505,
          17.503568009264473,
          11.544432771208466,
          -4.081493755606006,
          11.390048848823266,
          5.215349954828858,
          12.384308826345526,
          7.908953556333753,
          -5.3969987115966385,
          19.817419341900784,
          -5.140850809810336,
          -2.2631260859844824,
          2.6174684979423897,
          -0.8083632739777211,
          15.208590957850609,
          27.34956649353591,
          8.951196466607575,
          -3.7019839285859377,
          -0.6970086604427311,
          -9.509738093835034,
          -9.594497552816573,
          -5.8698975087345,
          22.047612832530515,
          6.041683738322515,
          -13.699210811603574,
          -10.730656131554818,
          -10.962199381229219,
          18.492339275541067,
          -2.2747341562649805,
          2.6339864917117084,
          -15.873683176613515,
          0.5226644000444071,
          -23.548577123876807,
          -0.01853457125238097,
          26.978199045532573,
          4.432492350736929,
          -4.612620760654723,
          1.3577202111635,
          -7.99886862825491,
          0.14332351784441746,
          9.567463151041466,
          -8.264691792413082,
          1.2181322146835678,
          -2.9730694455263147,
          5.763920299653607,
          7.840612273435191,
          5.135354460116171,
          22.00975482694765,
          -27.24774487064843,
          -9.03056672552705,
          7.50449387996268,
          3.773777380261182,
          8.116137315303343,
          1.0524065966173182,
          -20.929861417371082,
          7.6623787640608985,
          -12.704832962415088,
          11.267339004739066,
          2.810961582562659,
          14.517108769110177,
          -1.730510062592925,
          11.380683745659942,
          -0.2624961342212153,
          24.47461610316526,
          -13.480067614635868,
          3.500608662930084,
          -2.639151341351965,
          -24.011209034630156,
          0.6164858984867586,
          3.755317367256924,
          -5.581878993362268,
          -1.3614443396102163,
          4.163650648612053,
          6.284954910099222,
          -7.122294034367744,
          -10.47036084795061,
          -7.385869068943879,
          -4.997767830211463,
          1.8035052478459634,
          17.757994477900752,
          2.0242040538412245,
          -4.565055051826419,
          -11.947225566607255,
          0.6703966929336002,
          -6.372840762552836,
          0.06860949634367706,
          -3.5180784748552103,
          -1.3846822854616407,
          7.060402765927535,
          -1.1415544944248337,
          12.686363070508488,
          12.156045802142492,
          0.307987232652981,
          -5.1155846550112845,
          -1.6628658003245602,
          -1.9788079756890693,
          -1.869962187280469,
          6.678879502822433,
          -1.0146181255773186,
          -5.6270384615194295,
          1.3732700486859382,
          -15.785238564213312,
          9.499707707379804,
          -6.093677952118892,
          5.935679367319621,
          11.211143729732992,
          -4.041064929708539,
          4.771784554629331,
          10.983262154415101,
          -5.370722457075728,
          -7.10210424597788,
          11.395647280102471,
          -11.687004282367269,
          -7.759982275480262,
          -7.192179709590088,
          -5.908060481973288,
          -2.9393936577653204,
          17.62727035530431,
          24.31544670819174,
          6.933069508186602,
          8.138832925950918,
          16.753949769561313,
          -0.6537063309594188,
          -10.7903769547682,
          -4.815524254147753,
          2.0114365162720453,
          -3.222355936171795,
          -9.133331785246972,
          3.4088676871260954,
          4.681449497593163,
          -7.224034178049858,
          5.787412293379273,
          -24.64919127879874,
          -20.6840637777202,
          7.143780219847789,
          9.531183184099216,
          -5.5454741410365,
          7.909994569736927,
          9.89012653730596,
          9.042574818599123,
          10.809806038691848,
          -2.921248962268214,
          -2.9088432053753905,
          -17.92042179535732,
          -8.29315757202186,
          -29.191596393631066,
          -4.039625089667217,
          -17.430511658946294,
          -0.9595031638968129,
          -9.730953751009912,
          5.868585360111266,
          6.961057055493017,
          0.38069285060198566,
          11.853821556104679,
          -12.424530611124004,
          -0.6274310010240419,
          -2.354726090843444,
          2.826508928151669,
          2.397160182744028,
          17.574463125987876,
          12.958939903331284,
          5.358982764324041,
          -11.11103793917736,
          -14.498165615350695,
          1.8326484593504977,
          -2.942345626184679,
          21.54025548004025,
          1.038231983510341,
          -5.50674549077552,
          2.2623512970414703,
          -31.838001240159283,
          -4.734354979109642,
          -1.7800861617828025,
          11.69971687182536,
          -1.9787922462952945,
          -14.711889091506281,
          -6.302003945223048,
          -25.223138799266803,
          16.52112019201583,
          42.621042967290485,
          19.018029608339006,
          -4.17763196821305,
          13.795784966387936,
          -9.91160798752541,
          7.511798331314223,
          -0.16707144603864718,
          -4.124714619703187,
          -14.918348750802572,
          5.69227291335112,
          11.746052819915386,
          11.024842359302161,
          14.733208184098142,
          11.767039801740017,
          0.940530660539491,
          -12.149318273892392,
          -15.97322787976985,
          -4.670127249850777,
          11.400033713529746,
          -1.4115220367721077,
          5.027704915387453,
          -0.9699901688252396,
          19.159927445570233,
          -11.103843673666214,
          -25.60630184973369,
          26.993464625068988,
          -4.314847952009146,
          10.974357242109347,
          0.9067408643751658,
          -13.154003878239013,
          8.957441231033409,
          -6.438686977063624,
          -12.568859473543583,
          -13.261991698950213,
          -4.120238629572416,
          -11.705485620311734,
          4.484901216214458,
          15.431454309104716,
          -3.5015941222761953,
          4.248269062361638,
          8.375030237935446,
          1.753260655473125,
          14.536955995941085,
          3.8654441061531353,
          -10.606448705262506,
          11.053500983989771,
          -19.656101493445966,
          -0.5537009084293415,
          17.024526901336852,
          0.7082995330505186,
          -8.770797105667155,
          19.162170661604925,
          3.7883594077056792,
          15.983606787089705,
          -12.860978563551539,
          -14.040043976955898,
          -6.015902988090787,
          -23.95771879148712,
          -12.62674410588868,
          2.2880143580523016,
          25.070050912003662,
          -1.1227497293732325,
          15.057374600910602,
          2.340107594133885,
          32.0623712532868,
          -12.730172718108635,
          57.68299662743203,
          49.98458463222753,
          3.769657245611629,
          12.479850430983914,
          26.799596988179854,
          16.22789517801005,
          14.151476724505143,
          53.37622850352896,
          20.4858753771321,
          29.92690119942511,
          -11.637273869169926,
          3.599540816134333,
          21.649521354962662,
          -11.458706566461775,
          17.406869371552265,
          37.965444428880524,
          9.991339099699024,
          10.845755735401616,
          58.850676809315694,
          14.920571050552013,
          13.557925375330711,
          22.37058223057813,
          18.49023713829247
        ]
      },
      {
        "dims": [
          "1",
          "30"
        ],
        "dataType": 11,
        "name": "intercepts",
        "doubleData": [
          -9.849414751597521,
          -21.237567268818633,
          -8.735428250584077,
          -17.459035911036406,
          -0.6132225498905088,
          -3.5569480669159077,
          -4.104656030835864,
          6.264151150445171,
          2.6943148419647995,
          -7.299523950178319,
          1.038853473858263,
          18.879456665545295,
          -19.957113577420433,
          -25.92859275996823,
          -9.810364759226392,
          -3.557312440195574,
          -0.05278011249245718,
          -1.553348981842204,
          -4.038254338757554,
          -10.124145056503375,
          -16.425884251908247,
          -4.705984688409806,
          -5.106808884480407,
          -14.163531723376115,
          -11.252313224692069,
          -27.829755726598304,
          2.8132646541859088,
          4.623099371164702,
          -10.275479935212772,
          10.114230884928022
        ]
      },
      {
        "dims": [
          "30",
          "15"
        ],
        "dataType": 11,
        "name": "coefficient1",
        "doubleData": [
          1.5267885557607603,
          -3.611294064834763,
          -5.3495610455637665,
          -10.429704496347117,
          4.114849515727104,
          -4.794246706044097,
          1.834763755881136,
          -4.188273305397041,
          -3.5661617339967413,
          4.717459603768208,
          -0.9831383349089113,
          17.371580964981153,
          0.7368989405344242,
          8.349559873916952,
          -3.8714091279771243,
          -2.929674642610164,
          -7.9710062995420605,
          6.460720353817203,
          2.1448206048642504,
          10.942104226039307,
          0.6904364873655652,
          13.926218848976818,
          24.551894529037465,
          -3.40636161839453,
          -4.747100176466368,
          3.4358751557693785,
          -2.818670717078046,
          0.5477083911348646,
          14.35736366649764,
          -5.053516321101243,
          19.161294411038643,
          10.41042959152518,
          -3.187998293857308,
          9.794949322898027,
          3.0462829747061377,
          -5.985765151067806,
          2.831883474161573,
          3.131513114689343,
          1.6085609086794093,
          -1.4463879955407701,
          -2.4463295612199984,
          7.257208163968988,
          -3.956038314210475,
          -0.4324397604403059,
          4.157991192108156,
          -0.36790422483588314,
          -15.671001631412922,
          -7.692355716698322,
          -0.554841458363663,
          -4.121877762453288,
          -2.285767844082707,
          0.3057679480033027,
          -5.8578104732356415,
          -8.026410508400204,
          -9.528782848570314,
          1.8897395684339957,
          9.89389096388896,
          -2.3474082372335996,
          -4.8354464982090555,
          -3.05594432754801,
          7.390026832122864,
          14.086657642326658,
          2.970436977553834,
          -11.489998161920555,
          -2.341258608381235,
          -9.99293447805183,
          4.748741422263705,
          9.984440233139873,
          -17.408817514023994,
          6.494010826588476,
          -8.207970016467277,
          -5.651526749868209,
          5.313759723757167,
          -4.259691639987152,
          -1.502915948710448,
          -7.088887968273742,
          -15.886458106673665,
          4.014416913319421,
          2.0757387134076546,
          -1.6711278778639065,
          -1.9282547615257424,
          8.788757625836631,
          3.78483827625576,
          6.913213626365952,
          -2.6878921602696333,
          -0.47168168616634293,
          13.014335461655035,
          1.4498717429515873,
          4.489210855772575,
          -3.1015737244271513,
          -14.285807168748091,
          -6.582565538751142,
          -2.477889280403203,
          11.745163197293293,
          -6.959318623009125,
          -6.829532614155076,
          -8.814775693013358,
          -16.238413639969536,
          -3.554272323638414,
          -4.409385492568674,
          -5.958689813467827,
          -5.014103893391193,
          -11.98381395109023,
          8.349597548042938,
          -2.324321451707731,
          -4.331624734661581,
          8.103709460155018,
          -4.649454497809083,
          -4.919610810206063,
          -6.797576385755915,
          -8.467047304364176,
          -18.534633680575496,
          5.447342262022297,
          -9.643889328093247,
          -1.5442431705037665,
          -6.205003265705583,
          -10.460317848207286,
          -5.136204427595203,
          2.9393015171143437,
          3.284395251197998,
          -18.145423825973566,
          -6.695902543722076,
          -9.663263898736028,
          -4.715153085264582,
          -15.01072395259654,
          -2.5513556529601047,
          -14.889397533681628,
          -10.540030912656663,
          -8.689334796613595,
          -1.8650011318354895,
          -6.502864943347952,
          -17.46961701584254,
          -5.023733786767865,
          -9.365446686396304,
          -1.3928695566383151,
          15.665691164036003,
          8.955546282655378,
          -4.372994364999439,
          -8.379996930739194,
          -4.096761834670037,
          2.634829783123568,
          -3.552214274369274,
          3.5894135901614947,
          7.432250070674922,
          -6.341037204211294,
          -2.4679709425198872,
          7.6667448478937965,
          -1.9753469691425716,
          4.288641615784538,
          -3.290267448883814,
          -14.588604516155655,
          -7.252710295134201,
          3.9653283694976467,
          -12.954630682228824,
          0.35329999472442225,
          1.6317582850100343,
          -4.0909008630993196,
          -14.643597225359663,
          5.768594966308109,
          -9.838368127265493,
          -5.64077611400329,
          -10.920751923592386,
          -4.181570833120442,
          -15.918166951288402,
          -8.85580588866928,
          -18.49678574800451,
          -10.039159578567087,
          12.591097617558138,
          -16.10127407581862,
          0.8595048854943202,
          -2.3328422270995723,
          -1.4165889758099162,
          8.185435782324626,
          -4.624079161052687,
          -3.7477614772653447,
          6.764939892859812,
          -6.073200735538275,
          -7.914735713984257,
          6.367303759703623,
          -5.056943264049732,
          19.245582108843433,
          11.454733654450962,
          -4.671396959370433,
          -2.13462247358693,
          -0.18675684302315423,
          -4.653993607233185,
          -6.211806198773866,
          -10.08332436558014,
          -10.079208752311297,
          -3.4511162175956756,
          -1.9451026719881666,
          -2.7290091968964685,
          2.6127119346780856,
          -2.2398798409933334,
          -7.5103947989262405,
          5.249014968583243,
          14.196183690092715,
          -6.74241828101039,
          1.385450277039518,
          -7.571909253810602,
          0.4150394598413774,
          -2.8636288471415354,
          -12.731211448214758,
          2.5045848263008703,
          -2.4033059863010453,
          9.82614497197343,
          -1.716531204419686,
          -6.139351544919029,
          2.0985485374079658,
          4.973901367272843,
          -11.74454296966261,
          -19.20533150222542,
          -13.19281226593436,
          -4.6857279888274235,
          -8.546890649846409,
          -7.811843605053779,
          -3.2355276442309933,
          -8.090778346455043,
          -4.213543679968259,
          -11.102284617472051,
          0.032577984048646196,
          0.5474159546159514,
          -5.491783309286622,
          14.233831708435963,
          -3.3196267837215587,
          13.614348126244602,
          3.4035617118459083,
          3.9083804466955434,
          8.453382432810683,
          15.35166810766207,
          9.51370232126479,
          5.4431624544339545,
          -0.40222724906069673,
          6.597607327882864,
          -1.98188002442793,
          3.731917541376826,
          4.4778586124722315,
          -0.15285151536222086,
          2.386030733354068,
          11.737380632668424,
          -8.552856588687229,
          5.3882144012977475,
          -5.090334440589566,
          1.819334872715435,
          -10.743977800231022,
          -4.8994915760074695,
          -3.487657861694793,
          8.88721770584137,
          -3.453732223311696,
          -3.9772489575512298,
          -2.695831622796863,
          -17.83475023168811,
          1.9809720078342237,
          -9.70224335254444,
          -1.3901323457287906,
          7.105562545334771,
          6.086383602351271,
          4.428475410707755,
          -9.233639646334952,
          5.666914123633605,
          12.936510055605227,
          -8.994098019104761,
          -9.511092836707215,
          16.292471227686693,
          -3.3329818100040955,
          -2.6853948868184814,
          4.542645885070871,
          2.07648180880038,
          14.490404389959037,
          -1.6654171710832129,
          5.5374239487859365,
          -9.9284944591695,
          -5.5319057106273055,
          -3.386092882039498,
          8.809277662731423,
          -6.5167450674191905,
          7.558827873428265,
          7.095299685949635,
          -6.08391415675004,
          -6.563465559146409,
          6.257675760975449,
          13.071909911655695,
          -5.448899675065073,
          6.77134685284979,
          -1.3220555976378185,
          2.1574872325233825,
          -5.49191391244294,
          2.1782484407449125,
          6.920501487492524,
          7.548155492683503,
          -13.720326407830818,
          15.354860727041938,
          11.835297077685487,
          2.9865848757965683,
          7.047884112874878,
          0.8688375697052239,
          13.168580490886372,
          -2.8784685994984796,
          4.2119771873159335,
          3.2395866549786647,
          -5.682095725300238,
          -1.9758051709953668,
          -9.10018812574837,
          13.180449480264935,
          -7.132980448299024,
          0.16481405322565706,
          8.338323028275973,
          -11.986218969851326,
          -2.182733065330831,
          -4.50003148066394,
          3.0316354933207847,
          11.097948040599356,
          -19.700592745556932,
          17.616952121115776,
          -0.41104063808302377,
          3.8173539268840218,
          8.257802635015409,
          -4.262690055129853,
          -14.352953850447115,
          -4.882313683888491,
          -5.096055649402491,
          -8.237161682141268,
          -8.86819475978979,
          -9.22439448723816,
          -0.07858521627191264,
          -8.265959089276365,
          -11.247373648219224,
          2.8164916738429495,
          -2.720768437480839,
          0.40061710171449444,
          11.575978386327977,
          -13.645399807247182,
          -0.6219950140275589,
          -6.193027031260075,
          -2.6720483401300013,
          -11.327841312095675,
          -1.669085940091444,
          5.708750307621584,
          -7.73015795030624,
          -5.0799341076257125,
          -4.023964022050164,
          17.661103608001227,
          -3.5103960051270526,
          -2.079197993861921,
          -9.634269268858558,
          5.664448890119783,
          -7.080800165044954,
          -3.8482986077742414,
          -2.5287425522100735,
          9.775984462440478,
          5.70197745940498,
          8.96330895497766,
          -7.5831723599397165,
          -2.3826065520868434,
          -3.980982371629393,
          -14.710569215589784,
          18.112835654233244,
          6.127613964517001,
          5.659680639012971,
          2.08190765198479,
          18.991411673721377,
          5.175362953901172,
          -3.384964554879064,
          -18.225736876417223,
          -12.129002791974766,
          1.4508032283999481,
          -17.896594706209264,
          -20.792704144750758,
          8.587265748785725,
          -3.1874084754327465,
          -0.85280631273422,
          0.3910464969313153,
          6.590661402673089,
          -1.5094005458211142,
          -1.7457159418380406,
          5.3200268897490455,
          -12.493953220347267,
          -0.21183500984283019,
          2.470058875134328,
          2.529293375989694,
          -7.360054015801502,
          9.026866532570258,
          14.318569687591667,
          5.3212100068033035,
          2.9228280132076385,
          -8.103251223724088,
          7.184419819248775,
          1.553381535042551,
          22.351896630978878,
          -10.779759389139237,
          -10.109076326874154,
          -9.071705701638678,
          0.6456294476608545,
          -5.370605407202358,
          -8.713831236049066,
          -1.796701357693068,
          -12.242847316204001,
          -3.893489664177657,
          -7.12315893392668,
          3.5272435968164535,
          -22.72631481728306,
          -11.180310544064563,
          4.628975825491908,
          -21.243689518470518,
          7.592601278183789,
          14.29714215027324,
          13.280952762501034,
          -12.588169837765724,
          2.5302385501959925,
          1.7162308583172172,
          3.2205591791587316,
          -1.5848788118551695,
          -0.15289405122153144,
          -6.282796062210105,
          -0.9285648252084586,
          -3.881708177457093,
          1.3171463741136102,
          0.4229470991670414,
          7.111211781586247,
          -4.33700773437999,
          -15.652156069074422,
          -13.975879315650777,
          -1.4510526247209177,
          -2.844903481128479,
          10.911673225954331,
          3.7885288194304745,
          5.381392215503731,
          20.604332653627242,
          0.7433939747796202,
          3.882746355210095,
          -7.376988129450607,
          -2.0687520254146246,
          -4.263315927964268,
          2.452366480947672,
          4.299332999071657,
          -5.134630928407349,
          12.065236484091168,
          -8.15327492183487,
          -6.029992143627687,
          5.163900145500442,
          -0.4939371315722018,
          0.8322951963682798,
          -3.784631728423654,
          1.253798761387173,
          3.129229209185783,
          1.1536692225270038,
          -14.064145766325444,
          -4.005223141237795,
          -20.835556203105654,
          2.5129676799580247
        ]
      },
      {
        "dims": [
          "1",
          "15"
        ],
        "dataType": 11,
        "name": "intercepts1",
        "doubleData": [
          5.418638833782047,
          7.472996193245029,
          10.195914806237596,
          14.001843823296598,
          -0.17718653579287033,
          3.618570157319257,
          0.9210704062363807,
          -5.818874012546753,
          -2.85658652633646,
          2.481872785892832,
          9.116946910600806,
          -9.884674648852904,
          0.598825839161297,
          -12.584762386830022,
          -0.4222268773317416
        ]
      },
      {
        "dims": [
          "15",
          "5"
        ],
        "dataType": 11,
        "name": "coefficient2",
        "doubleData": [
          6.645715640635234,
          -1.4369916505395677,
          -6.111344451531611,
          -6.071030388857692,
          4.006122098669404,
          6.809443069649971,
          1.5485628754115823,
          2.8846205489100436,
          -7.579065032872437,
          -8.4416304579089,
          -0.501650690208428,
          8.151087830612731,
          -2.8673120566886197,
          3.804558866497488,
          -4.523171225106574,
          -10.072230783485418,
          10.734382800599729,
          -7.085702574243369,
          -6.680935892538512,
          -19.105219307136913,
          0.25670231476391187,
          6.1675121875721075,
          -1.8169982879948088,
          -4.204708131296627,
          -4.943585406755388,
          9.507584701109733,
          -4.828272437051286,
          -6.802190065232763,
          -4.136401525869711,
          -6.109992165002734,
          -5.7938278959727665,
          6.171077972936013,
          -13.588796271319081,
          -5.28188367958539,
          -7.849721730958933,
          3.265045087081844,
          2.689576541562053,
          5.261627857475533,
          -3.5572043920570615,
          -5.226733550670465,
          -12.381553583030817,
          7.223431225580099,
          -4.305281042530076,
          -6.295979732291812,
          7.989472939412382,
          -6.8168681683639285,
          8.17007279235751,
          -7.237540583278702,
          -2.4772860635878478,
          -6.868111206988163,
          -13.393289954888408,
          13.05363074215423,
          -11.232182702956836,
          -6.361354247804589,
          -9.158338801479857,
          -4.0863051989455315,
          4.985961929770593,
          -4.682430005950843,
          -4.7622948320368454,
          4.723435599450103,
          -11.819175406618623,
          6.6477389955493065,
          1.6049439419684248,
          -7.413272027492104,
          -8.913425102537426,
          -3.86060925397197,
          -4.836486081661228,
          7.261202284204144,
          -6.6618862799696075,
          6.636953131442249,
          -3.2845621134736582,
          -5.905103383504265,
          2.6704378711583763,
          3.715925860060144,
          -0.057127405963168856
        ]
      },
      {
        "dims": [
          "1",
          "5"
        ],
        "dataType": 11,
        "name": "intercepts2",
        "doubleData": [
          -5.469519100915036,
          -4.927413906471601,
          -7.037319860020713,
          4.65882729991598,
          -7.019691498500422
        ]
      }
    ],
    "input": [
      {
        "name": "X",
        "type": {
          "tensorType": {
            "elemType": 11,
            "shape": {
              "dim": [
                {},
                {
                  "dimValue": "17"
                }
              ]
            }
          }
        }
      }
    ],
    "output": [
      {
        "name": "output_label",
        "type": {
          "tensorType": {
            "elemType": 7,
            "shape": {
              "dim": [
                {}
              ]
            }
          }
        }
      },
      {
        "name": "output_probability",
        "type": {
          "sequenceType": {
            "elemType": {
              "mapType": {
                "keyType": 7,
                "valueType": {
                  "tensorType": {
                    "elemType": 11
                  }
                }
              }
            }
          }
        }
      }
    ]
  },
  "opsetImport": [
    {
      "domain": "",
      "version": "21"
    },
    {
      "domain": "ai.onnx.ml",
      "version": "1"
    }
  ]
}