{
  "irVersion": "10",
  "producerName": "skl2onnx",
  "producerVersion": "1.19.1",
  "domain": "ai.onnx",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "X"
        ],
        "output": [
          "cast_input"
        ],
        "name": "Cast",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "11",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "cast_input",
          "coefficient"
        ],
        "output": [
          "mul_result"
        ],
        "name": "MatMul",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result",
          "intercepts"
        ],
        "output": [
          "add_result"
        ],
        "name": "Add",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result"
        ],
        "output": [
          "next_activations"
        ],
        "name": "Sigmoid",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations",
          "coefficient1"
        ],
        "output": [
          "mul_result1"
        ],
        "name": "MatMul1",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result1",
          "intercepts1"
        ],
        "output": [
          "add_result1"
        ],
        "name": "Add1",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result1"
        ],
        "output": [
          "next_activations1"
        ],
        "name": "Sigmoid1",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations1",
          "coefficient2"
        ],
        "output": [
          "mul_result2"
        ],
        "name": "MatMul2",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result2",
          "intercepts2"
        ],
        "output": [
          "add_result2"
        ],
        "name": "Add2",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result2"
        ],
        "output": [
          "next_activations2"
        ],
        "name": "Sigmoid2",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations2",
          "coefficient3"
        ],
        "output": [
          "mul_result3"
        ],
        "name": "MatMul3",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result3",
          "intercepts3"
        ],
        "output": [
          "add_result3"
        ],
        "name": "Add3",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result3"
        ],
        "output": [
          "next_activations3"
        ],
        "name": "Sigmoid3",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "next_activations3",
          "coefficient4"
        ],
        "output": [
          "mul_result4"
        ],
        "name": "MatMul4",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "mul_result4",
          "intercepts4"
        ],
        "output": [
          "add_result4"
        ],
        "name": "Add4",
        "opType": "Add",
        "domain": ""
      },
      {
        "input": [
          "add_result4"
        ],
        "output": [
          "out_activations_result"
        ],
        "name": "Sigmoid4",
        "opType": "Sigmoid",
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "binariser_output"
        ],
        "name": "N17",
        "opType": "Binarizer",
        "attribute": [
          {
            "name": "threshold",
            "f": 0.5,
            "type": "FLOAT"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "binariser_output"
        ],
        "output": [
          "label"
        ],
        "name": "Cast1",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "out_activations_result"
        ],
        "output": [
          "output_probability"
        ],
        "name": "ZipMap",
        "opType": "ZipMap",
        "attribute": [
          {
            "name": "classlabels_int64s",
            "ints": [
              "0",
              "1",
              "2",
              "3",
              "4"
            ],
            "type": "INTS"
          }
        ],
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "label"
        ],
        "output": [
          "output_label"
        ],
        "name": "Cast2",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ],
        "domain": ""
      }
    ],
    "name": "ONNX(MLPClassifier)",
    "initializer": [
      {
        "dims": [
          "35",
          "40"
        ],
        "dataType": 11,
        "name": "coefficient",
        "doubleData": [
          1.9052946133004,
          11.000661994256284,
          -5.672163095885558,
          2.457522738107962,
          10.10952878095602,
          57.90645641923264,
          -3.15353664220945,
          2.4822219587817624,
          -1.1441395416574554,
          4.848635579867463,
          11.002610090018408,
          -33.86335494830461,
          -0.8391042782593611,
          -1.5427026163770898,
          -5.975533083442715,
          -6.753472048215682,
          17.97702467873683,
          4.991418757322822,
          51.949857171767675,
          2.0660604797960587,
          11.99823091405243,
          4.5067925510677105,
          17.246824283620146,
          17.230468298418042,
          -43.78633698435047,
          6.681420843133664,
          0.598707299308141,
          4.064633462534714,
          19.377142976391674,
          -1.8566928385842907,
          7.273846704736669,
          2.2083112587939873,
          48.25005034473064,
          1.4367663221282319,
          -37.28283794069007,
          -7.77054886384173,
          10.009182034502732,
          -6.6471357771122825,
          15.302028160115993,
          18.314978633002784,
          2.7293224369115006,
          -11.161949945016165,
          9.161578444294921,
          -7.191832839997706,
          -15.665142133411583,
          4.7096499529999205,
          8.101071464553366,
          -9.436967458989367,
          -1.8267104071033082,
          0.05526122444590906,
          -12.738072897748541,
          6.66601551262242,
          10.424878764849447,
          -2.9364936314661194,
          -2.212800714846444,
          -3.616679564948078,
          3.7065905377395127,
          -16.406467446085337,
          -13.189259872634276,
          -2.2500686548388535,
          -17.094444541230096,
          -17.836987696380717,
          -7.940746069765843,
          -2.516072533704936,
          -6.422846339481673,
          -5.578041166374452,
          4.7992305173090495,
          1.2468775890355417,
          24.757768821565246,
          2.2931748378075105,
          12.20063111496754,
          20.056532786359323,
          -3.802595792094797,
          -3.01025980051609,
          39.05999586652218,
          -21.492868794633928,
          14.534482268858799,
          -2.5347757532508117,
          11.231950056214854,
          -4.5208066525615225,
          10.483476844202816,
          -6.6550128643672215,
          4.722239660287443,
          15.188227266348662,
          6.9482011700202015,
          -11.104853968426438,
          10.823340319534543,
          19.142809488555066,
          -7.070846125145863,
          8.566969110084326,
          5.023163083074363,
          9.624380789711504,
          15.028289995184654,
          -6.333888758249158,
          -0.7876175542126641,
          4.338046461121432,
          -1.3737346661516967,
          -15.26507317218014,
          -6.854230494823328,
          5.85996961229699,
          -6.409070920044147,
          28.31641132850744,
          -3.814327183006394,
          3.351171093285022,
          41.23647077707331,
          31.351865023333605,
          20.410750387761883,
          1.5720883027648365,
          -13.743357374359167,
          7.347186213781854,
          7.504953722147489,
          3.758795889290165,
          10.008608315929047,
          10.092418537189085,
          13.035733320188708,
          0.2707595409661609,
          0.5362929170831598,
          -1.8990216709505896,
          -10.071435027596042,
          4.471028185713969,
          8.759022969927331,
          -7.332193123338865,
          -3.575089743534534,
          -9.12541811833556,
          15.82662827309992,
          -8.663397642997348,
          12.589187846157483,
          -1.5761646322657608,
          6.324266865902217,
          -4.906704732926948,
          -4.441348164844421,
          -18.20910265813535,
          -10.824443885697269,
          3.4166244066919775,
          19.762641683997725,
          9.349066909394502,
          -20.164614362668118,
          -10.187629375831685,
          17.919929861398643,
          -17.86524859474701,
          20.371293096245434,
          -19.636794627237908,
          5.220953282398361,
          13.20614560782318,
          8.639518375168262,
          -11.004246390685664,
          -4.457707397367444,
          -11.981580479509066,
          -13.888144434846222,
          6.461890646184216,
          2.456386176839785,
          18.851983534101358,
          -42.554073920466315,
          -10.225599745862755,
          3.52519592952275,
          3.638203493932681,
          10.587452776505948,
          -2.358279827374925,
          -13.478947646702357,
          3.0989087595789995,
          0.06447996729971675,
          -0.015172896300972488,
          0.07252305509735826,
          0.11965996657322941,
          0.15530467319698515,
          0.11620488501848958,
          -0.15947351231124376,
          -0.045730972643319365,
          0.07511460314595525,
          -0.1072452983176671,
          0.006870526815997813,
          -0.14555260350814872,
          -0.09798072467541022,
          -0.15725012344565026,
          0.09592126824706382,
          -0.09016581931090202,
          -0.05050792958287928,
          0.1398107649895094,
          0.06676146410518019,
          -0.15290076534446057,
          -0.10951042991381657,
          0.039674679792448986,
          0.025222751418070705,
          -0.08560384607373059,
          0.14181369787862114,
          0.03722112535532554,
          0.01163762473549984,
          0.029364475313919974,
          0.07515754011863668,
          -0.061418507286901264,
          -0.0332408618844067,
          -0.09476463475864791,
          -0.10248893510796503,
          0.14513141483222558,
          0.07823696204650471,
          -0.003116140056693417,
          -0.08902600970827752,
          -0.08022683710461269,
          -0.1443470717861247,
          -0.021419440398998874,
          -0.06146720754733341,
          0.06412551492209756,
          -0.039926082096957013,
          -0.1046410007257502,
          -0.15523927724427883,
          -0.14133567852218837,
          0.058589434481888886,
          -0.01512254724246162,
          0.011946720321322074,
          0.12955230180784777,
          0.1601440296180437,
          -0.09246105771558989,
          0.05326111810202783,
          -0.07729858807048678,
          -0.15655472800294212,
          0.08438611497676721,
          -0.05878215239163424,
          -0.0380605327853108,
          0.028844248501569913,
          0.10811997272870194,
          0.042125293717571066,
          0.12170719442130973,
          -0.07396086171875337,
          0.09734168833837686,
          -0.10267087065630531,
          0.147881135916077,
          0.06123341465387347,
          -0.09291480357478649,
          0.14611062301672983,
          0.07539719076605828,
          -0.08036232301194153,
          -0.0936319161089526,
          0.005944328277932065,
          -0.15491790756601032,
          -0.09553987328855193,
          -0.024597622903427818,
          -0.041095912334069354,
          -0.011896216587150177,
          -0.07262616040273064,
          0.02834364886445681,
          -6.296145130359247,
          -19.95443309257413,
          -8.0553678690592,
          -20.549929089860708,
          4.258599338849969,
          8.85543840603821,
          0.5256162546862727,
          0.6217868043835947,
          -22.445263051371807,
          13.191119744384803,
          3.50887665666724,
          9.923169880972502,
          11.258541427553483,
          -2.5859121336276907,
          26.118724555964487,
          19.250418217822862,
          -2.545361074744355,
          14.331766555721197,
          0.209924887872661,
          -9.50318129726017,
          1.9920890078578775,
          -12.219843085733556,
          -6.919909480809883,
          -6.776874093609583,
          -9.848646798219269,
          9.077649215701133,
          0.8126903062606109,
          10.081035899582831,
          7.90991679782629,
          -0.30268008926187917,
          20.82801658918487,
          -2.4410747103287327,
          -6.259506337687759,
          -8.039187160303968,
          -24.51675913806774,
          13.362984170383635,
          -1.0542553365816005,
          2.6479808023184512,
          -4.864759222973394,
          11.475899602288994,
          -15.712773303514462,
          1.0988975208416776,
          -10.839630686460747,
          7.730600409910538,
          1.1750080909298024,
          -4.834780378302899,
          -2.813112852959081,
          7.570233914074155,
          5.577563624819714,
          1.0925927065989458,
          -15.447364822186886,
          -13.841620363523566,
          29.88666088155882,
          -5.438856145981621,
          3.1163683396579964,
          -1.946163681149295,
          -12.190694103479796,
          -18.01232599259861,
          13.203086433960088,
          2.5302015214086446,
          15.530887321808493,
          3.07695854617695,
          9.992500259332802,
          -1.7831047587439925,
          3.6200094535554532,
          21.87869376807864,
          10.64779644712183,
          -16.54165868688429,
          8.08849776985592,
          2.8052199398280013,
          17.3133517329759,
          -1.5647126943062102,
          6.103892312766415,
          3.467128789508049,
          -6.103528526375939,
          -5.540200877851146,
          0.9682814195960593,
          -19.11594910726767,
          5.509421880487253,
          17.540342680479956,
          -12.67426132083427,
          -19.037535231195953,
          -12.272909229605897,
          10.642496713821565,
          -3.976672759663824,
          2.0254076769883023,
          -0.8696526884709448,
          6.941665625817234,
          -26.850650428457687,
          0.37327614571118656,
          -4.357537613810336,
          -2.3125187289697595,
          -13.319986379636713,
          -10.542495731532695,
          -7.70130153581421,
          11.072346276586167,
          -1.251487733642734,
          -10.836347885624253,
          8.588538470270011,
          -7.226620043213623,
          14.829493223762212,
          -17.91546392635927,
          -5.144881792499804,
          -11.315951104133235,
          9.34822799300553,
          13.795897875331983,
          6.600983979041827,
          -13.097137419109291,
          13.436023752809772,
          0.3418241734133396,
          16.51059040860851,
          2.124707595472473,
          1.1861296422494758,
          -0.28547872718227124,
          -10.127644767404952,
          19.941555378904503,
          14.474794188466381,
          -8.541582540858276,
          0.6070356126409685,
          18.27502955462975,
          2.1287602482941828,
          36.708310435648286,
          2.6618929818168278,
          4.6429877021537935,
          8.518792577482174,
          -17.482529260856666,
          -5.4795229731779465,
          10.795992425196324,
          11.844682048496681,
          0.8298463592153638,
          7.386041088056268,
          12.343975005946508,
          28.316139480809422,
          6.76573719573308,
          -13.975007204901724,
          11.839633176586053,
          -15.53108516589723,
          3.417161965053192,
          -4.892550582141252,
          -8.727618672434794,
          22.049945464223917,
          20.512133641068132,
          -0.3469614312430105,
          -18.518803715306973,
          10.190897722549392,
          -0.5567471727055999,
          13.092693593192301,
          -2.605509383179481,
          6.93178558643121,
          8.84872095925458,
          -14.303665552970141,
          0.14877780143901562,
          9.129608524648402,
          2.787584654342613,
          -6.5123007879501085,
          2.922461853698359,
          -6.258840281631963,
          0.9276261376903752,
          -3.251428475552865,
          13.124369949151728,
          -3.95330241986585,
          4.8918597176074154,
          -12.86661912649243,
          -9.975160677958094,
          1.5788268232769027,
          1.1888371734933931,
          -8.1203746438784,
          5.512388025175552,
          1.1441563984840657,
          -16.2471944966011,
          -8.29228617010361,
          -1.7263128190402226,
          -1.226659592920697,
          -3.1907901812100037,
          -8.982548490408497,
          5.192516943242793,
          -5.8307870470308885,
          -1.2433231738104984,
          -12.291827629283333,
          -4.2907940587588,
          4.878267402517982,
          -4.677199009632916,
          -0.15092647196650333,
          -2.4283456273228636,
          4.872358708392195,
          -1.9084078836469618,
          -1.8810340805219905,
          1.1549652889960758,
          -6.681146263925335,
          5.321661331557971,
          -1.8857575900893353,
          -5.0161078948543505,
          2.084587207306469,
          0.6421172548246012,
          -15.475545047473286,
          0.11940139026189592,
          -6.717283253728942,
          -12.031733541534834,
          -6.518684183947858,
          -10.528971447032658,
          -1.4829490537616252,
          3.1113380785806997,
          -5.42785362655953,
          -9.874920482642587,
          -7.357093069718623,
          9.33457782440421,
          2.9886906215963402,
          5.400675603623265,
          -0.8542340224695681,
          -0.9526011898267555,
          -5.29704715758656,
          3.1231374825795615,
          15.70299060638571,
          6.124078528836854,
          -9.663394480422594,
          -27.556106501947134,
          9.173776001289207,
          -12.870866113900819,
          14.794917653681209,
          3.3241463112983274,
          1.067584774983324,
          -10.52726259941233,
          8.160049299353853,
          4.579787585130993,
          -11.851718279999718,
          1.9994144394334994,
          -1.221656571095413,
          1.6698536891061513,
          -2.1633175016713038,
          -2.21466913811166,
          -4.557189602598204,
          8.129446529130645,
          -5.518020735826237,
          0.9917239217575744,
          23.82150994076545,
          -8.260315347439274,
          3.8801667897844045,
          -0.6871552498685769,
          7.805772159465348,
          13.093409231422552,
          10.65115611774013,
          -3.7357072643982456,
          -0.4251272177959278,
          -3.0618341174719035,
          12.818011605798054,
          7.242362687520692,
          -3.1364932215919707,
          -2.1959071592187924,
          -2.1693600440314458,
          6.465441665705405,
          -6.596442404371645,
          -16.295227235885413,
          16.961481912929507,
          -7.27060439599243,
          -11.757780340876721,
          -11.94279256844256,
          -0.2318473161494832,
          3.398484861777206,
          12.266677215441916,
          9.167812403135613,
          4.349508884605237,
          8.070160747291055,
          7.0331361415911005,
          -12.169541835974869,
          9.599036062175022,
          5.595741519311177,
          3.3401191185222627,
          -8.786810815474581,
          1.174323001763733,
          -0.5079245164480383,
          -5.171331695794597,
          10.21091853283869,
          -0.29423605320166213,
          -1.6909557902305967,
          18.582543812792313,
          -10.469189771069994,
          -9.212685965840258,
          2.2692833024362975,
          0.9726091375500575,
          24.408788971766636,
          14.183239286502719,
          -17.76850476037667,
          3.850630153079087,
          5.947607486829648,
          -10.485103767085405,
          -15.274421550860552,
          -4.646989137193966,
          -0.1665370782259052,
          5.898800536370132,
          -13.196839685188584,
          -6.745821129948393,
          -3.8427851975521086,
          12.369569038382801,
          -7.4706628410305855,
          -8.63715879967235,
          -6.629207085829649,
          -5.697960353615178,
          -5.642785484888407,
          10.512268040323615,
          -1.1205483404948187,
          -0.14086951693721392,
          -2.7599028022679413,
          10.518342410095547,
          -4.054844478165924,
          1.2019765429649045,
          -1.5478612442711226,
          -0.17547730440923512,
          -17.737852797311813,
          -0.6960635209614308,
          -3.3697461839352023,
          -6.87437320970778,
          4.465806627071235,
          6.2675530884513,
          17.110433093135477,
          11.013158588472441,
          -14.987976303091175,
          -3.9678490950221375,
          -16.271462893473153,
          8.673513774826446,
          5.325692809464315,
          -17.07387949936608,
          -14.244298509247919,
          -5.180871135331232,
          -15.861663859803787,
          1.6892095202624142,
          4.083172807179714,
          -2.2807764572411386,
          -2.9196418098370387,
          17.865534078954113,
          -2.405267382472802,
          13.263877428501905,
          5.649989306619389,
          -24.818740693309813,
          0.98069897428525,
          10.044680099657814,
          -17.334703671562295,
          -10.433767967716895,
          3.2418368513013376,
          -8.003198702301782,
          -1.6771702273835367,
          -12.627397360588121,
          5.188057905734993,
          4.842731821398682,
          1.575831922709762,
          -0.5801915398186845,
          10.284913797325752,
          5.722581849474759,
          0.5969092569963328,
          -7.427081157421564,
          1.443468596541127,
          11.246429856290504,
          -20.679769198565797,
          -5.0036880248974285,
          -2.1818862152611813,
          -5.658887176973542,
          12.373649841190595,
          -6.6163776841027255,
          -1.3801620009136235,
          -4.31381743372874,
          -1.127626963178372,
          -17.89037934659043,
          -7.974225000890433,
          -1.8963291220480598,
          -10.140768221677742,
          -3.874162328321321,
          0.01948680653559768,
          9.847409476955313,
          -4.870577451108943,
          -6.956054535972788,
          -7.768299241408073,
          0.5444601167604903,
          -10.078781099845498,
          -0.3958136866851172,
          2.025730532498106,
          -3.032606464197765,
          -2.7938848470328552,
          13.928138504974061,
          -2.9458865823484675,
          -5.835150127118959,
          10.605298400321994,
          9.96620883803228,
          -3.8189803054822233,
          5.561906090576834,
          20.70072021729036,
          -4.547170940753828,
          -7.354760241818988,
          -1.8354361464316251,
          18.775572660493918,
          -1.4483263613341704,
          0.09841265807500774,
          -4.731213160753098,
          11.385684431168558,
          3.102540081177295,
          8.08344166750467,
          -8.399007930378447,
          3.240394967971193,
          -3.8537997634540573,
          -7.682806528685677,
          4.919747412807284,
          -4.761365774995783,
          34.26596140839763,
          -26.588528176920914,
          -8.551300516374557,
          0.3706638094032951,
          -20.791374901816244,
          -2.2874223732833836,
          3.7227733065591897,
          1.3680343207906942,
          -14.032913959125592,
          0.986166427873171,
          -5.732896129564914,
          1.0056476707328454,
          -26.271489521577344,
          33.10017982309611,
          -39.214275146421535,
          -57.18995410417469,
          -3.5633327741738197,
          -20.332408857597205,
          0.3400604659247014,
          -7.46414587652248,
          -25.91414892111731,
          9.35554068466592,
          26.23063691045646,
          7.3336609325865405,
          10.220373462642865,
          -0.9055638361995296,
          8.178298194695518,
          -38.67621889273907,
          6.890119872375557,
          9.668255583605559,
          -15.992006026938956,
          -2.5600421821171366,
          -2.37433694748909,
          -12.89835810330691,
          10.452731899904796,
          -6.255662118710447,
          -12.971710669282126,
          2.195310505458003,
          -4.811937638119475,
          -30.743649396224733,
          -4.82953858269325,
          17.04895253366767,
          -1.9466989728494895,
          -0.3779146878883982,
          -3.3847798224369607,
          12.447360687949141,
          -2.901393840869205,
          2.8035160590317236,
          4.494211044901368,
          -6.335331487346242,
          0.5098632043667684,
          -5.462884650467757,
          -9.120269147578494,
          2.196223411143374,
          -1.1616701194649148,
          2.206312690524969,
          0.8902507893069321,
          -2.3922090550190482,
          -3.68539359773635,
          0.6637585291418919,
          -2.2284470554450797,
          -6.127287197694869,
          0.039815478265518504,
          -10.285921153217721,
          -6.706819734658421,
          -2.872386422219733,
          0.5661826856563381,
          -5.0172720414512755,
          5.3632413308484335,
          0.026636343572212447,
          -0.36976366442235287,
          -8.26557480889532,
          -0.9947282235659375,
          2.909483587245581,
          -18.551765835002207,
          -0.42803315657095886,
          -5.40351615865104,
          0.6358943570376341,
          2.809246693339522,
          -3.094770947139346,
          0.5865082915115702,
          -8.98026777303992,
          -6.657418618091481,
          -0.08936127266546243,
          -6.6006011449506845,
          2.2119215663584573,
          -4.148834891539803,
          -6.401709197117588,
          -3.3116591330996052,
          4.663763186328913,
          -0.9927273205392113,
          -4.028201933552572,
          13.476173908580462,
          -9.047450960193343,
          -3.5815924000229997,
          -6.958552741972579,
          -2.672919555362493,
          -6.977220644629734,
          -8.134024246592821,
          3.8485477316123013,
          -5.573978119062231,
          -9.348583979776517,
          -8.726330401649646,
          7.073650031436285,
          -2.1020495582437775,
          3.9290319571689114,
          -7.387795418464277,
          -3.243732385902342,
          0.9331793534593249,
          -5.978259859505199,
          -5.402027384806705,
          -3.077875856067982,
          6.791702106372544,
          -7.389320183225417,
          -1.7927157534224896,
          -1.5753911050765517,
          2.2243811959080455,
          3.148402671059887,
          -6.40447058793655,
          4.297108825724985,
          6.349731674132962,
          -7.852927259847532,
          1.754866854510086,
          -1.806596246111906,
          0.361483225119563,
          -1.7117306948885338,
          -2.7670077697894127,
          0.8435346258240083,
          -7.173936781324802,
          -4.239068528460857,
          0.5360293284122459,
          2.165812921689238,
          -9.266032191337297,
          -5.569299060489408,
          -9.257264307735786,
          11.031423950032714,
          1.169770197400984,
          0.7363360412156564,
          4.222025129925974,
          -3.0561281537078973,
          -2.5201360083188007,
          6.222311447339415,
          -3.6401731400315516,
          0.0756165112389629,
          -0.9086879842537056,
          -5.468790704813445,
          -0.1852714738033712,
          6.184542499984464,
          -4.286306408719776,
          -1.2288111597980096,
          -5.119559784186377,
          0.1798904599536473,
          -3.257023158055248,
          -2.562885523874275,
          16.1183584253873,
          -2.8853457514110445,
          -4.109647065338466,
          -5.062465474430151,
          2.4155420592597423,
          -3.173498440263546,
          -0.7542315160273424,
          -4.048049621500275,
          -2.3940194124969327,
          -4.363322676721124,
          0.7639561451163385,
          1.8078494770349722,
          1.1206485565921813,
          -0.5636045073793571,
          2.422827452105346,
          1.2214343777394998,
          0.1734930811436141,
          -0.775840233190072,
          -1.011031907338245,
          1.4875103865194346,
          -0.3201215899391797,
          -0.06658169682765697,
          -0.7811825162884263,
          -1.4199255079934758,
          -0.04925976898619948,
          -1.3468312028545975,
          0.3203070283188961,
          1.8049936983297103,
          0.9834350877104572,
          -7.801546695890178,
          2.946529275217589,
          -0.11843668869517854,
          1.1528272718844452,
          -0.18973558490360554,
          -2.1621285821053764,
          -0.1077928131501961,
          10.058681160807062,
          8.028237346765357,
          -3.7059467840702793,
          -2.9710640195164264,
          2.167362822340155,
          2.344799813288796,
          0.48226550309248783,
          -0.1906524685439655,
          1.159961491896261,
          -0.16703352407634225,
          -0.15517427561902633,
          2.2228042570393605,
          1.4944630828008176,
          5.166021830270498,
          -1.864722535131529,
          -4.29575043432697,
          1.2196917734121624,
          0.2618508372484035,
          -0.5888756965821648,
          -0.9603111451993228,
          -1.327937092800792,
          0.7034155889455773,
          1.8433176582041826,
          0.31346693715677115,
          9.461399381970258,
          -1.012370563690927,
          -0.378830897710143,
          0.84418346522512,
          0.13118293655709964,
          -0.3203310945375506,
          -0.5045317341711458,
          1.6294200732676232,
          0.2797535191543583,
          1.253465029362564,
          4.201785090683754,
          -0.17970947259186726,
          -1.4890417165805105,
          0.2915727466727105,
          0.3718630037744054,
          -0.09351200753879332,
          -5.651732258607921,
          -3.1986929242885576,
          -1.7945429099680188,
          2.512376665199197,
          -0.19436615863130807,
          -0.7933877165261368,
          0.4369500000644423,
          1.0856848683931843,
          -4.731952370622568,
          -0.056416591391440785,
          10.72348380592126,
          -9.509810539619624,
          -7.472816302513441,
          2.9191995792765395,
          -1.4270754640912915,
          0.7251468600212722,
          0.9505533980333223,
          0.22849527248087828,
          0.7759582470226762,
          -3.505370758332045,
          11.857465660913954,
          -7.259578864917859,
          13.061599576744905,
          -7.392774911450067,
          1.028869407598938,
          -9.612723101957954,
          -0.25319289207841755,
          2.8456567696387975,
          0.6702561065210088,
          4.868855445168478,
          -11.84475845522341,
          0.4708023939455359,
          -13.11445952528237,
          -3.840945838548881,
          -2.48287140899978,
          -2.2112779056258,
          -9.843185096057987,
          3.5123069709680244,
          1.0894011586500072,
          -7.77834297002085,
          -4.822451223802468,
          -6.988718306157357,
          -1.3399208401811573,
          -5.940789146239797,
          3.1448926613062533,
          3.8932307351307953,
          -9.865875730206639,
          4.437998295260988,
          -8.18151791772077,
          -1.506126321676391,
          -8.550164317520382,
          7.0772618909817435,
          3.4751361268751513,
          -4.595469828768642,
          -9.108822449455472,
          20.899689006498875,
          -0.8445954888398477,
          0.4592220324392315,
          -2.5459128862904947,
          -7.582317131000908,
          2.5993714074754695,
          -2.6331635734913417,
          -9.461623328830315,
          3.1117140869644606,
          -4.815486772348535,
          7.363594001363775,
          -0.9561316428784261,
          -2.3381492389800123,
          6.329796282827973,
          3.0638972342176056,
          -0.5976458123003163,
          -4.446398057780692,
          2.6807514174674414,
          -3.8654498078797697,
          -0.5417790460405039,
          0.08267430785516292,
          1.1842712648286504,
          -5.882158742676369,
          0.5253282963266673,
          1.178185848914043,
          0.7178974396786533,
          -0.0019985560599255227,
          2.8333415648277773,
          0.6432849518731477,
          -0.6489059139365444,
          -8.732556025518408,
          3.416798398747594,
          0.10479137573017548,
          8.646893965299883,
          -0.618924371839937,
          -3.487918796545214,
          1.331592632264368,
          1.0079524611942015,
          0.7827495288823029,
          -0.298060703477699,
          -12.95260406916285,
          -8.243489892817111,
          -3.7461830041244766,
          -2.5602518532947847,
          5.420438690063893,
          -16.187252188965296,
          1.2905103591855396,
          -7.041062526913117,
          -4.046682520443731,
          -0.6783362707502837,
          8.425968116598453,
          -0.13553049870601855,
          -16.377715042275305,
          -14.178188327239315,
          -5.501683193109408,
          2.4615473135250054,
          -2.0991584928635474,
          -0.5771382185954911,
          -4.121310730543457,
          2.101078945746603,
          -7.893200487171586,
          2.0422385878665046,
          -0.674171507488501,
          -1.1124070342939598,
          -0.6094414562909938,
          -3.2975416957667374,
          0.29035530168607565,
          -3.552359269514326,
          -1.786878759328219,
          -6.837479341616598,
          -3.481828260753101,
          3.3605544942014816,
          -4.341042567068553,
          -4.616119029205473,
          -0.574876649557848,
          2.5852408937607945,
          -0.6977033808760161,
          -4.389698419037117,
          -0.5174640026358072,
          -0.03734664282117437,
          1.4106506232049898,
          0.3097370642482934,
          -0.23492611325592938,
          -0.5612286725689485,
          0.30198643350025,
          0.5870705937852155,
          0.9771864105206232,
          -0.2781051128627377,
          -2.379712873382135,
          -0.5109983920041788,
          -0.9232834937397602,
          0.0318926337496138,
          6.624985750395488,
          -0.39440447905210824,
          -2.5303185491642264,
          -0.32184153609818344,
          0.2415537622485685,
          0.1133845788608696,
          2.5635306033572736,
          -1.081736259340125,
          5.584789215361194,
          -0.43618688650600085,
          1.1390941859980153,
          -0.4524075831227937,
          -0.10384549117738519,
          0.77586596174658,
          0.4527960783363969,
          -1.1449171108297054,
          -0.31883427874302345,
          2.2433591143050404,
          4.6323308688512395,
          -3.4206180468931477,
          -0.13099540135672025,
          -0.4665252833759329,
          0.46516720153785635,
          -5.442359203870159,
          3.4447706023762694,
          5.010263316878605,
          -2.572691198015754,
          -3.814967128801929,
          -0.9589428763422017,
          1.2322159316084893,
          0.9957562658448235,
          -4.0515102566298715,
          2.9973939432563164,
          2.0190154818404933,
          8.754261948524244,
          7.223330482320224,
          1.7729085328439584,
          1.6831853130669172,
          -3.3300798308157624,
          -5.31763528445792,
          -1.6005662579629705,
          -0.27542657444485136,
          2.524423302083547,
          -1.323938804235386,
          -5.383005088211889,
          2.3928849999407835,
          4.76405105387167,
          1.7222691089355244,
          0.15600585598995736,
          2.2094115006653974,
          3.6243995084875404,
          0.767934356897682,
          0.644508617427668,
          -5.962685449593999,
          -2.4823991211900895,
          1.7439526235777727,
          -1.7968303695078531,
          -1.0874124720030984,
          -1.3638089046083528,
          2.353696282816726,
          3.427010015580116,
          -4.882878592937064,
          4.222695614208694,
          0.9971945125326057,
          6.872794936910563,
          -18.761573682724634,
          -0.2888645213676683,
          6.246903453070897,
          8.742317413303583,
          -5.449636762557476,
          4.779695051732519,
          5.162081692598074,
          -2.3530529122351362,
          11.644290463031732,
          -27.16737362744394,
          -3.2035998042593574,
          4.262031104589555,
          -25.963124622106125,
          7.495221825861947,
          -7.452179772733361,
          4.119881333003424,
          -4.4175348857658765,
          -10.109725668365236,
          -1.2307050417069492,
          10.854326905786538,
          -0.5869491273835665,
          -1.463956168652069,
          -2.493477156073168,
          6.132929098253802,
          2.3977851042216356,
          -3.2086149701481625,
          2.419955511431692,
          0.7911564492114204,
          -7.329868364268257,
          6.298280828333569,
          0.7731644442486106,
          10.769280155514116,
          2.346049922375532,
          2.9164024817842713,
          -0.5715586491613129,
          -0.25323447767259655,
          0.5041878351879188,
          2.546343690236972,
          1.0124351744464324,
          -4.653584095941299,
          -0.5571780328365473,
          1.1220588315880726,
          -11.55894359927727,
          5.377133905962225,
          1.4211970336743067,
          -3.663092029269204,
          -2.8282746396416982,
          -8.565932827828616,
          -8.691106391552164,
          10.976787678333423,
          -11.844243236503198,
          -14.383308662712755,
          3.564450631575375,
          -3.900956751337705,
          7.846717026227415,
          -6.720083671311503,
          0.06617837803108921,
          7.656940720501938,
          -2.8157238848636097,
          -6.991370868301947,
          -12.072833801575841,
          -4.435163942233521,
          -2.2220167389602254,
          -7.974466423771174,
          -9.38046795820347,
          1.9599426721273514,
          4.424651807671838,
          -6.1851482682305585,
          0.6921148781982881,
          -13.472845871997952,
          -2.0442761700574703,
          -9.978642190440697,
          -3.7723222895155817,
          -3.793148325787063,
          -10.579809174993075,
          -2.5148533635498365,
          1.6170564904668228,
          -9.114822269761733,
          5.115015371597183,
          -3.095776949008536,
          -1.8624906115016624,
          3.4252757409879413,
          0.4596906416243444,
          -1.329126394675808,
          -2.384060463321062,
          -1.1376245330602475,
          3.314277058624965,
          0.33033572963509544,
          -2.8305909622158674,
          -4.20017410254437,
          -3.046223628163642,
          -0.520383880157257,
          -1.8036030847823044,
          4.246966983558079,
          0.24452522868985868,
          -2.584525690111671,
          -2.5296834704389966,
          3.254316752181006,
          2.7173955406449175,
          -3.6839465883038853,
          0.24536182573253038,
          -1.0504569743504746,
          0.4943424079652685,
          -3.271165352167195,
          0.7990652563440479,
          -1.4362878172132962,
          1.3998861773657032,
          -1.6083828580209218,
          2.8718381779224416,
          2.5059151229522296,
          -0.41452437356000954,
          -0.408362873712497,
          2.5527526297223964,
          -3.1203678076067267,
          4.505471820611651,
          1.6439226398997373,
          0.7916152467989799,
          0.9905553387252876,
          -0.5899581596404249,
          -4.0072769715623116,
          9.083639548063312,
          -3.0280669203061352,
          -2.185613747065716,
          -1.8984939039552995,
          -2.7052393668954315,
          -3.819627813559625,
          -6.257522877605829,
          2.3520085866719658,
          -4.003257553462973,
          4.0846810532980795,
          7.471763778159219,
          -1.8451894998227494,
          17.72468188745219,
          0.757205743481747,
          3.086543911201808,
          -2.105113290365329,
          -0.006770747790608636,
          -3.5785045052023934,
          -7.583246317611618,
          -0.2547358658127633,
          -0.8740000249519466,
          -7.309851908260731,
          0.25325976384032906,
          0.12961386726643181,
          -3.304400831009856,
          -2.5977561167234966,
          -8.89715500363895,
          -0.8255306195943273,
          2.8178537703586732,
          1.260720652333303,
          -3.77059208433748,
          -6.319710884599717,
          -2.359883262262496,
          1.8200149655408293,
          -2.1129539275258638,
          -2.2460613150345097,
          -2.879777235778631,
          -1.0343521239564657,
          -3.770984453466515,
          5.32509180869169,
          2.0454981359622897,
          5.526949045713791,
          2.00499919711466,
          -1.1880631357043656,
          -4.205693551859941,
          1.371746685411992,
          -0.6050600187988927,
          4.342283456694967,
          1.6522027005043645,
          0.29304203414874785,
          -1.1441597782098967,
          6.201020532400316,
          -4.2302727177089245,
          -2.35006814173461,
          -0.8790231574230085,
          -0.8404303153332534,
          1.9285598093398513,
          -0.9352161976882963,
          2.2907144208300143,
          2.7827166969930834,
          -0.4126567300993035,
          -3.793087833093791,
          -0.9333919186717548,
          -0.24509224181164588,
          -4.759397916242797,
          -7.111812806975345,
          -6.529969348388589,
          -3.9704359788984074,
          1.6833660780869601,
          4.8058622138210705,
          -3.4406082923015653,
          -0.2090939645703866,
          -1.228271696135063,
          -1.4707035659355976,
          1.4523892146423287,
          2.5652279227461334,
          -4.33790939914391,
          0.5773161688036255,
          6.482723375933642,
          11.613522177919977,
          -15.51223186190415,
          -10.060014865131622,
          -1.583587220342205,
          -0.8614938916867865,
          -3.201277912174989,
          2.4032318553622933,
          -4.366396422771496,
          6.127249078551705,
          -3.0438803932238616,
          -4.841964805930089,
          -7.632322229603737,
          -10.711623349426294,
          -4.906775238702064,
          4.554442829972948,
          0.3663789958616667,
          -6.398358334038713,
          -5.066200364567283,
          -0.039320131737540905,
          3.6745938989494875,
          -2.2234495628188675,
          -7.165995987118052,
          -10.205231607733873,
          6.8237971621757625,
          -6.845837867932084,
          3.694620219727202,
          -6.329311693002737,
          3.0774257342713556,
          -4.195697444402076,
          -7.634650397778235,
          -8.086733657842858,
          4.547210894199443,
          -3.0448398963258594,
          0.11323875316869095,
          -2.2396964345247525,
          1.51653573572535,
          10.078639642500196,
          -5.448572936441094,
          0.46624801732595705,
          -3.0926788382372594,
          -12.69059210576631,
          7.915945691325233,
          1.642961862932635,
          -10.68634247467754,
          12.364379717666441,
          -0.15284706460686415,
          -3.461831181021519,
          -2.6509722310691703,
          -16.11207283622526,
          0.7677872978599173,
          6.367295937604122,
          4.608166631214667,
          -5.828546032642031,
          1.8415614731586847,
          2.844323899065307,
          6.184014782992854,
          0.10625616278690032,
          -3.7712215450258317,
          1.5794895270213658,
          -19.944791811492095,
          -6.39124967022879,
          -5.828129662467596,
          3.92582468322389,
          -8.014815440129958,
          2.9882052552685003,
          -6.917429926640985,
          10.551060804857613,
          4.517740181999795,
          -0.6458709342036603,
          -0.013762128682945242,
          -4.122169913949385,
          -0.00037312855233686756,
          -1.5309916423876255,
          1.9287431730704045,
          2.313537820848805,
          -9.888898622599307,
          -9.409871523488386,
          5.2731271485776405,
          -2.424552127412855,
          1.6111959195759527,
          -5.978559004392891,
          -1.946912344185816,
          0.9225381209200988,
          -0.36210518965880223,
          0.031772111790828485,
          -0.2263011485699446,
          -3.720571540863959,
          2.9440847825811662,
          0.0658712357858735,
          -0.7376474989346049,
          -8.783146835210442,
          0.827690494836389,
          -0.3210239515205855,
          2.0970683733761146,
          0.26365705437609044,
          -7.069013952788432,
          -1.8954394353144552,
          -0.4929669535631579,
          -1.0349492921463996,
          3.669474338567422,
          -0.1273976611274434,
          2.7797007693325098,
          0.9683581318503767,
          0.07246445145809365,
          -0.11602467253999356,
          0.9601120774981076,
          0.8172775842331896,
          -0.9584029693763668,
          1.6882634000730532,
          -0.6596339265583523,
          1.0010870644904766,
          -4.4655438764403605,
          -2.4292463184563173,
          -2.698931248875467,
          -2.035817814855068,
          0.6574491640039578,
          -2.9817671366852863,
          0.3084208480837078,
          -0.6611242455340524
        ]
      },
      {
        "dims": [
          "1",
          "40"
        ],
        "dataType": 11,
        "name": "intercepts",
        "doubleData": [
          1.1451429820316155,
          -1.6597433578020788,
          -7.362681603472515,
          -1.692164501423752,
          -10.618575358955743,
          10.097493352773999,
          -8.115450752217571,
          -3.2965759980516425,
          -4.50264403405621,
          -5.652177908781626,
          -1.4573412648748296,
          -7.18075830561058,
          -3.6747489756917764,
          -10.710235308702714,
          -5.0928471578122565,
          5.133694142541522,
          -1.4695606512127648,
          -9.140804878660946,
          -7.550093701256495,
          -0.2264299190606095,
          -10.485357305890473,
          -5.963664637825564,
          -10.900628697300315,
          -9.41319168865979,
          -2.3884355461719635,
          -4.703202330671338,
          -7.0373362859913975,
          -1.6409585987896518,
          0.024173620526681306,
          -7.113394688797609,
          -6.529735282888255,
          -6.187123880570073,
          -3.336940706624498,
          -7.4237772346867565,
          -2.263425440167876,
          -3.428405114151465,
          -6.396866973562667,
          0.19058953288953703,
          -4.480797700357368,
          -2.3017108055090474
        ]
      },
      {
        "dims": [
          "40",
          "35"
        ],
        "dataType": 11,
        "name": "coefficient1",
        "doubleData": [
          2.1083185065296273,
          -9.341491984200106,
          6.191974625277123,
          -0.5177407896494635,
          -6.355252384156152,
          -3.9148402754998144,
          2.336528887114268,
          -2.916907167910101,
          -7.75819071001456,
          1.468540002239981,
          3.1089243204221413,
          1.68934318394223,
          6.8134059646136595,
          -0.7744450513816947,
          4.975768597494432,
          -1.0607374729476775,
          -0.970536794523135,
          -5.969879150925812,
          14.012046396622248,
          -11.797623881229462,
          1.9107445727344121,
          2.9182091228624247,
